Autodesk.Revit.DB.Structure.StickElementProjectionY
Presets for given Analytical Projection.

Autodesk.Revit.DB.Structure.StickElementProjectionY.Varies
Projection types are different at each end.

Autodesk.Revit.DB.Structure.StickElementProjectionY.Plane
Use a Plane for projection (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.StickElementProjectionY.Right
Horizontally, corresponds to right side of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionY.Center
Horizontally, center of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionY.Left
Horizontally, corresponds to left side of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionY.LocationLine
Location Line.